%% 黄金分割法
clear all
a = 0; % 搜索区间下界
b = 3; % 搜索区间上界
l = 0.618; % 黄金分割点
e = 0.01; % 允许误差
x1 = b - l * (b - a); % 更新下界
x2 = a + l * (b - a); % 更新上界
y1 = F1(x1); % 下界函数值
y2 = F1(x2); % 上界函数值

while abs(b - a) >= e
    if y1 > y2
        a = x1; % 最小值提高
        x1 = x2; y1 = y2; % 更新下黄金分割点
        x2 = a + l * (b - a);
        y2 = F1(x2); % 更新上黄金分割点
    else
        b = x2; % 最大值降低
        x2 = x1; y2 = y1; % 更新上黄金分割点
        x1 = b - l * (b - a);
        y1 = F1(x1); % 更新下黄金分割点
    end
end
x = (b + a)/2; % 极小值点
y = F1(x); % 极小值